quickstarts/demos/policy-security-wss-username/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:policy-security-wss-username="urn:switchyard-quickstart-demo:policy-security-wss-username:0.1.0"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username><!-- Username --></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">the-frog-1</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <policy-security-wss-username:doWork>
            <work>
                <command>WORK_CMD</command>
            </work>
        </policy-security-wss-username:doWork>
    </soap:Body>
</soap:Envelope>
